var x = 6, y = 14, z =4 ;
console.log(x += y - x++ * z )
document.write("(x += y - x++ * z) отримуємо таке значення  6 += 14-(6*4) <br>") 

/*
1. Де постфіксний інкремент буде 6+1, але все рівно залишиться 6
2. Де 6 ми множимо на 4 отримуєм -24
3. Далі відбувається додавання y+-24=-10
4. Далі присвоюєм і отримуєм результат 6+(-10)=-4
*/

var x = 6, y = 14, z = 4 ;
console.log(z = --x - y * 5  );
document.write("(z = --x - y * 5) отримуємо таке значення z = 5 - (14*5) <br>")

/*
1. Префіксний декремент -хх(6-1=5)
2. Далі виконується множення (y*5)=70
3. Далі віднімаємо (5-70)=-65
*/

var x = 6, y = 14, z =4 ;
console.log(y /= x + 5 % z);
document.write("(y /= x + 5 % z) отримуємо таке значення 14 / (6 + 1)  <br>")

/*
1. Залишається залишок від ділення 5%z (5%z=1)
2. До значення х ми додаємо залишок від ділення (6+1)=7
3. Змінну y ми ділимо на 7  і отримєм значення 2
*/

x = 6, y = 14, z = 4;
console.log(z - x++ + y * 5);
document.write("(z - x++ + y * 5) отримуємо таке значення  4 - 6 + (14 * 5) <br>")

/*
1. Спочатку множимо y*5(14*5)=70
2. Де постфіксний інкремент буде 6+1, але все рівно залишиться 6
3. Далі віднімаємо z-6=-2
4. Потім додаємо -2+70=68
*/

var x = 6, y = 14, z =4 ;
console.log(x = y - x++ * z);
document.write("(x = y - x++ * z) отримуємо таке значення   x = 14 - (6*4) <br>")

/*
1. Де постфіксний інкремент буде 6+1, але все рівно залишиться 6
2. Потім x*z (6*4)=24
3. Від y ми віднімаємо (x++ * z), тобто 24 і отримуємо 14-24=-10
*/

